# read design 
read_verilog src/mux.v                                                                

# elaborate design hierarchy
hierarchy -check -top mux

# the high-level stuff
proc; opt; fsm; opt; memory; opt

# mapping to internal cell library
techmap; opt

# cleanup
clean

# write synthesized design
write_verilog src/mux_synth.v   