read_verilog generate_mod.v

proc; opt; memory; opt; 

techmap; opt;

dfflibmap -liberty ./lib/cmos_cells.lib

abc -liberty ./lib/cmos_cells.lib

clean

write_verilog generate_mod_sintetizado.v